{
  "titulo_presentacion": "S08.s1 - Representaciones Cromosómicas: Binaria, Real y Permutacional",
  "subtitulo": "Codificando Soluciones: El ADN de Nuestros Algoritmos",
  "autor": "Ms. Ing. Johan Max Alexander López Heredia",
  "fuente": "Algoritmos Evolutivos - 1411-2278",
  "logro_aprendizaje": "Al finalizar la sesión, el estudiante diferencia los tipos de representaciones cromosómicas (binaria, real, permutacional) y selecciona la más adecuada para modelar soluciones a problemas de optimización específicos.",
  "conceptos_fundamentales": {
    "representacion_cromosomica": {
      "definicion": "Es la forma en que codificamos una posible solución a nuestro problema en una estructura de datos que el Algoritmo Genético pueda procesar.",
      "importancia": [
        "Define el 'espacio de búsqueda' que el algoritmo explorará.",
        "Determina qué operadores genéticos (cruce, mutación) son posibles y efectivos.",
        "Una buena representación puede hacer que un problema difícil sea mucho más fácil de resolver.",
        "Una mala representación puede impedir que el algoritmo encuentre buenas soluciones.",
        "Es el puente entre el problema del mundo real y el lenguaje del algoritmo."
      ]
    },
    "componentes": [
      {
        "nombre": "Gen",
        "descripcion": "La unidad básica de información (un elemento en nuestra lista)."
      },
      {
        "nombre": "Cromosoma (o Individuo)",
        "descripcion": "Una secuencia de genes que representa una solución completa."
      },
      {
        "nombre": "Alelo",
        "descripcion": "El valor que puede tomar un gen (ej. 0 o 1, un número real, una ciudad)."
      }
    ]
  },
  "tipos_de_representacion": [
    {
      "nombre": "Representación Binaria",
      "descripcion": "Ideal para problemas de selección, donde las decisiones son de tipo 'Sí' o 'No', o para representar subconjuntos de elementos.",
      "tipo_de_problema": "Selección (Sí/No), subconjuntos.",
      "ejemplo_cromosoma": "[1, 0, 0, 1, 1]",
      "ejemplo_aplicacion": "Problema de la mochila: cada gen representa un objeto, y su valor (1 o 0) indica si se incluye o no en la mochila."
    },
    {
      "nombre": "Representación Real (Valor Real)",
      "descripcion": "Perfecta para problemas de optimización de parámetros o cuando las variables de decisión son continuas dentro de un rango.",
      "tipo_de_problema": "Optimización de parámetros, variables continuas.",
      "ejemplo_cromosoma": "[3.14, -0.5, 42.0]",
      "ejemplo_aplicacion": "Encontrar los coeficientes de una ecuación que minimizan un error, como en 'y = ax^2 + bx + c'."
    },
    {
      "nombre": "Representación Permutacional",
      "descripcion": "Clave para problemas donde el orden o la secuencia de los elementos es la solución, como en problemas de ruteo u ordenamiento.",
      "tipo_de_problema": "Ordenamiento, ruteo, secuenciación.",
      "ejemplo_cromosoma": "['C', 'A', 'D', 'B']",
      "ejemplo_aplicacion": "Problema del viajante de comercio (TSP): el cromosoma representa el orden en que se visitan las ciudades."
    }
  ],
  "guia_seleccion_representacion": {
    "titulo": "¿Cómo Elegir la Representación Correcta?",
    "preguntas_clave": [
      {
        "pregunta": "¿Cuál es la naturaleza de las variables de decisión?",
        "respuestas": [
          {
            "condicion": "Decisiones de sí/no.",
            "representacion_sugerida": "Binaria"
          },
          {
            "condicion": "Números continuos o parámetros.",
            "representacion_sugerida": "Real"
          },
          {
            "condicion": "Es un orden o una secuencia.",
            "representacion_sugerida": "Permutacional"
          }
        ]
      },
      {
        "pregunta": "¿La representación es 'natural' para el problema?",
        "descripcion": "Una codificación que se parece a la solución del mundo real suele ser mejor y más intuitiva."
      },
      {
        "pregunta": "¿Existen operadores genéticos estándar para la representación?",
        "descripcion": "Para las representaciones binaria, real y permutacional, existen operadores de cruce y mutación bien definidos y estudiados."
      }
    ],
    "nota_adicional": "A veces, se pueden usar representaciones híbridas o más complejas (árboles, etc.) para problemas muy específicos."
  },
  "ejercicios_practicos": [
    {
      "id": 1,
      "problema": "Planificar un horario de clases. Tienes 5 cursos y 5 bloques horarios. Debes asignar cada curso a un bloque horario único.",
      "representacion_adecuada": "Permutacional",
      "justificacion": "La solución es un ordenamiento o asignación única de cursos a horarios, lo que encaja perfectamente con una permutación.",
      "ejemplo_cromosoma": "[Curso3, Curso1, Curso5, Curso2, Curso4] (representando la asignación a los bloques 1, 2, 3, 4, 5 respectivamente)"
    },
    {
      "id": 2,
      "problema": "Diseñar una aleación de metal. Debes decidir el porcentaje de 3 metales (Cobre, Zinc, Estaño) en la mezcla. La suma de porcentajes debe ser 100%.",
      "representacion_adecuada": "Real",
      "justificacion": "Las variables de decisión son porcentajes, que son números continuos (reales). Se necesitaría una restricción para asegurar que la suma sea 100.",
      "ejemplo_cromosoma": "[60.5, 25.0, 14.5] (representando %Cobre, %Zinc, %Estaño)"
    },
    {
      "id": 3,
      "problema": "Seleccionar qué características de un conjunto de 10 posibles usarás para entrenar un modelo de machine learning.",
      "representacion_adecuada": "Binaria",
      "justificacion": "Para cada característica, la decisión es binaria: se usa (1) o no se usa (0).",
      "ejemplo_cromosoma": "[1, 0, 1, 0, 0, 1, 1, 0, 1, 0]"
    },
    {
      "id": 4,
      "problema": "Encontrar los valores de 'a', 'b' y 'c' que minimizan el error de la ecuación `y = ax^2 + bx + c` para un conjunto de datos.",
      "representacion_adecuada": "Real",
      "justificacion": "Los coeficientes 'a', 'b' y 'c' son parámetros numéricos que pueden tomar cualquier valor real.",
      "ejemplo_cromosoma": "[2.5, -1.1, 7.0] (representando los valores de a, b, c)"
    }
  ],
  "resumen_y_reflexion": {
    "puntos_clave_sesion": [
      "Se definió qué es una representación cromosómica en Algoritmos Genéticos.",
      "Se exploró la Representación Binaria, ideal para problemas de selección (sí/no).",
      "Se analizó la Representación Real, perfecta para problemas con variables continuas (parámetros).",
      "Se comprendió la Representación Permutacional, clave para problemas de ordenamiento y secuenciación (rutas, horarios).",
      "Se practicó cómo elegir la representación más adecuada según la naturaleza del problema."
    ],
    "preguntas_de_reflexion": [
      {
        "pregunta": "¿Por qué crees que no existe una 'representación universal' que sirva para todos los problemas?",
        "analisis": "Cada problema tiene una estructura única. Forzar una representación no natural complicaría la definición de operadores genéticos efectivos y podría ocultar la estructura del espacio de búsqueda, haciendo que el algoritmo sea ineficiente o incapaz de encontrar buenas soluciones."
      },
      {
        "pregunta": "¿Qué pasaría si usaras una representación permutacional para un problema de selección como el de la mochila? ¿Sería posible? ¿Sería eficiente?",
        "analisis": "Sería posible, pero muy ineficiente. Se podría interpretar la permutación como un orden de prioridad para meter objetos, pero no maneja la decisión de 'no meter'. Generaría muchas soluciones redundantes o inválidas, complicando innecesariamente un problema que es naturalmente binario."
      },
      {
        "pregunta": "¿Cómo se relaciona la elección de la representación con el principio de 'formular bien un problema'?",
        "analisis": "La elección de la representación es una parte fundamental de la formulación del problema para un algoritmo genético. Una buena formulación (y por ende, una buena representación) expone la estructura del problema de una manera que el algoritmo puede explotar eficientemente."
      }
    ]
  },
  "proximos_pasos": "En la próxima sesión, se verán los operadores de selección y cruce para manipular estos cromosomas."
}